{"title":"The Infinite Monkey Theorem Experiment","description":"An attempt to convince Joe Rogan about probability.","content":[{"text":"Here is a piano with just two working keys; G and E-flat.","graphic":"piano","type":"two"},{"text":"We told a computer to hit a random key, four times. How many attempts before it plays the correct notes (excluding duration) to the start of the iconic Beethoven’s 5th? Here was the first attempt…","graphic":"piano","type":"animated"},{"text":"The next X attempts…","graphic":"piano","type":"results"},{"text":"And finally on the Y attempt, success!","graphic":"piano","type":"success"},{"text":"So why did we do this? Because we want to make you believe in the infinite monkey theorem."},{"text":"According to Wikipedia, “the infinite monkey theorem states that a monkey hitting keys at random on a typewriter keyboard for an infinite amount of time will almost surely type any given text, such as the complete works of William Shakespeare.”"},{"text":"“Yeah, right!” you may be thinking. You are not alone. Podcasting mogul Joe Rogan has mostly refused to believe it either (though he did fixate more on the monkey than the probability).","video":"videoid"},{"text":"In episode 710 he admits, “it could be possible, but I’ve seen no evidence that it has ever been able to be replicated, even in a simple sentence.”"},{"text":"Challenge accepted. Though we thought it would be more fun to play around with music instead of something that felt like an English class assignment."},{"text":"Before we jump back into our tunes, a quick math digression. How likely is the Shakespeare thing, for real?","graphic":"probability","type":"tk"},{"text":"It will probably take forever, but if we did have forever, it would happen!"},{"text":"Back to Beethoven. What were the odds of our first test?","graphic":"probability","type":"tk"},{"text":"It is quite likely. But we cheated a bit. We assumed that all notes are the same length. What happens to the odds when we include two possible durations for each note?","graphic":"probability","type":"tk"},{"text":"We ran this too. We also decided to zoomorphize our computer, meet Meryl the monkey. It took her X attempts to get it right.","graphic":"piano","type":"Meryl"},{"text":"But I think Joe needs more proof.  After all, we aren’t even using a full piano equivalent of a typewriter. So we’ve actually crafted a real experiment, which now has been running for X days, Y hours, and Z minutes.","graphic":"clock / results"},{"text":"We ask Meryl to perform 1,000 random attempts <em>every second</em> since Meryl never gets tired. Each time she makes a breakthrough, we gradually increase the complexity; increasing the length of the song, note duration options, or piano size. Here is what she has achieved so far:","graphic":"results table"},{"text":"And if you were hoping to catch a live performance, you’re in luck! She plays live right here, 24/7/365. Here is what she is working on now (though we slowed it down so you can keep up).","graphic":"piano","type":"live"},{"text":"We think there is a good chance she will get <span>current melody</span> right in the next X days."},{"text":"Tk"},{"text":"Tk"},{"text":"Want more, be sure to check out the <a href=http://libraryofbabel.info/ target=_blank>Library of Babel</a>."}],"method":[{"type":"text","value":"We deviate from the typical thought exercise implementation by restarting after each attempt vs a continuous string of key mashing."},{"type":"text","value":"We run more attempts per minute to speed up time simulation as complexity grows."}]}