{
	"title": "The Infinite Monkey Theorem Experiment",
	"description": "The most fun you can have with music, Joe Rogan, and probability.",
	"content": [
		{
			"text": "We instructed a computer to hit a random key, four times. How many attempts were needed to play the correct notes to the start of the iconic <span class=inline-audio>Beethoven’s 5th</span>? Here was the first attempt…"
		},
		{
			"text": "Nope, not it. But <span class=beethoven-attempts></span> attempts later, success! Here are the last few in action. Granted, it’s not perfect, but the notes are right.",
			"graphic": "piano",
			"type": "success"
		},
		{
			"text": "As we play additional notes, the chances of success become more slim. Here is that same thing, visually, with all four notes."
		},
		{
			"text": "You get the picture. <strong>The number of possibilities goes up exponentially with each new note</strong>, but the odds are never zero. Shakespeare will effectively take “forever,” but if we did have forever, it would (almost surely) happen!"
		},
		{
			"text": "While the probability kept shrinking for the Beethoven melody, it was still quite likely, quite quickly. But we cheated, a bit. We assumed that all notes are the same length. What happens to the odds when we include two possible durations for each note?"
		},
		{
			"text": "That escalated quickly! In our experiment, we ran this one as well. It took <span class=beethoven2-attempts></span> attempts to get it right. Here are the last five attempts."
		}
	],
	"method": [
		{
			"type": "text",
			"value": "Thanks for reading! Want to support more of these stories? Become a friend of The Pudding on <a href=https://patreon.com/thepudding target=_blank>Patreon</a>."
		},
		{
			"type": "text",
			"value": "Be sure to check out the inspirational <a href=http://libraryofbabel.info/ target=_blank>Library of Babel</a> for more infinite monkey theorem-esque content."
		},
		{
			"type": "text",
			"value": "Data for this story is updated every 10 minutes, available <a href=https://github.com/the-pudding/data/tree/master/infnite target=_blank>here</a>. We deviated from the typical thought exercise implementation by restarting after each attempt instead of a continuous string of key mashing. Estimated time to completion is based on how many attempts per minute we are running in our calculation, which is throttled to get a relatively consistent progression timetable (and maxes out at 100 million per minute). The full proof and explanation is available on <a href=https://en.wikipedia.org/wiki/Infinite_monkey_theorem target=_blank>Wikipedia</a>."
		}
	]
}