{"title":"The Infinite Monkey Theorem Experiment","description":"The most fun you can have with music, Joe Rogan, and probability.","content":[{"text":"Here is a piano with just two working keys; <strong>G and E-flat</strong>. Go ahead, press them.","graphic":"piano","type":"two"},{"text":"We instructed a computer to hit a random key, four times. How many attempts were needed to play the correct notes to the start of the iconic <span class=inline-audio>Beethoven’s 5th</span>? Here was the first attempt…","graphic":"piano","type":"animated"},{"text":"Nope, not it. But after <span class=beethoven-attempts></span> attempts, success! Here are the last few in action. Granted, it’s not perfect, but the notes are right.","graphic":"piano","type":"success"},{"text":"So why did we do this? Because we want to make you believe in the <strong>infinite monkey theorem.</strong>"},{"text":"According to <a href=https://en.wikipedia.org/wiki/Infinite_monkey_theorem target=_blank>Wikipedia</a>, “<strong>the infinite monkey theorem</strong> states that a monkey hitting keys at random on a typewriter keyboard for an infinite amount of time will almost surely type any given text, such as the complete works of William Shakespeare.”","youtube":"simpsons"},{"text":"“Yeah, right,” you may be thinking. You are not alone. Podcasting mogul Joe Rogan has <em>mostly</em> refused to believe it (though to be fair, he did fixate more on the monkey’s behavior than the concept)."},{"text":"In episode 710 he admits, “it could be possible, but I’ve seen no evidence that it has ever been able to be replicated, even in a simple sentence.”"},{"text":"Challenge accepted, Joe. Though we thought it would be more fun to do it with music instead of something that felt like required school reading."},{"text":"Before we jump back into the tunes, a quick but important math digression. <strong>How likely is the Shakespeare thing, for real?</strong> Even if we just ask a monkey to type Hamlet, without punctuation, the odds are unthinkably small.","hamlet":"true"},{"text":"Given that there are 26 possible options for each key press, we get (1 / 26) x (1 / 26 ) x … and so on. We have to write this out about 130,000 times (the approximate length of Hamlet)."},{"text":"To begin to understand where this insane number comes from, we bring back Beethoven. How do we calculate the odds of just getting the first two notes (G, G) correct from just two keys?","odds":"true"},{"text":"As we play additional notes, the chances of success become more slim. Here is that same thing, visually, with all four notes.","graphic":"probability","type":"note"},{"text":"You get the picture. <strong>The number of possibilities goes up exponentially with each new note</strong>, but the odds are never zero. Shakespeare will effectively take “forever,” but if we did have forever, it would (almost surely) happen!"},{"text":"While the probability kept shrinking for the Beethoven melody, it was still quite likely, quite quickly. But we cheated, a bit. We assumed that all notes are the same length. What happens to the odds when we include two possible durations for each note?","graphic":"probability","type":"duration"},{"text":"That escalated quickly! In our experiment, we ran this one as well. It took <span class=beethoven2-attempts></span> attempts to get it right. Here are the last five attempts.","graphic":"piano","type":"beethoven2"},{"text":"But I think Joe needs more proof.  After all, we aren’t even using a full piano equivalent of a typewriter. So we’ve actually crafted a real experiment, which has now been running since <span class=experiment-start></span>.","clock":"true"},{"text":"We ask the computer to perform up to millions of random attempts <em>every minute</em> to speed up or simulation. Each time it makes a breakthrough, we gradually increase the complexity by increasing the melody length, the note duration options, or piano size. Here is what has been achieved so far:","results":"true"},{"text":"And if you were hoping to catch a live performance, you’re in luck! There is a live show, right here, 24/7/365. Currently in the works below is <span class=current-song></span>. We slowed it down so you can keep up. Not familiar with the song? Watch it on <a href=https://www.youtube.com/watch?v=dQw4w9WgXcQ target=_blank>YouTube </a>.","graphic":"piano","type":"live"},{"text":"We think there is a good chance it will be played correctly <span class=current-estimate></span>."},{"text":"Want to see everything in our experiment? Play around with each melody below to generate random attempts.","dropdown":"all","graphic":"piano","type":"all"},{"text":"All said and done, the point here isn’t the real numbers, but the faith that given enough time, randomness will prevail. Will our experiment eventually play even the simple Nokia ringtone in our lifetime? Almost certainly not. Given enough time would it? Almost surely."}],"method":[{"type":"text","value":"Thanks for reading! Want to support more of these stories? Become a friend of The Pudding on <a href=https://patreon.com/thepudding target=_blank>Patreon</a>."},{"type":"text","value":"Be sure to check out the inspirational <a href=http://libraryofbabel.info/ target=_blank>Library of Babel</a> for more infinite monkey theorem-esque content."},{"type":"text","value":"Data for this story is updated every 10 minutes, available <a href=https://github.com/the-pudding/data/tree/master/infnite target=_blank>here</a>. We deviated from the typical thought exercise implementation by restarting after each attempt instead of a continuous string of key mashing. Estimated time to completion is based on how many attempts per minute we are running in our calculation, which is throttled to get a relatively consistent progression timetable (and is capped at 10 million per minute). The full proof and explanation is available on <a href=https://en.wikipedia.org/wiki/Infinite_monkey_theorem target=_blank>Wikipedia</a>. Send love or hate to sup@pudding.cool."}]}