{"title":"The Infinite Monkey Theorem Experiment","description":"An attempt to convince Joe Rogan about probability.","content":[{"text":"Here is a piano with just two working keys; G and E-flat. Go ahead, press them.","graphic":"piano","type":"two"},{"text":"We told a computer to hit a random key, four times. How many attempts before it plays the correct notes (excluding duration) to the start of the iconic Beethoven’s 5th? Here was the first attempt…","graphic":"piano","type":"animated"},{"text":"And the next __ attempts…","graphic":"piano","type":"results"},{"text":"Finally, on the __th attempt, a success!","graphic":"piano","type":"success"},{"text":"So why did we do this? Because we want to make you believe in the <strong>infinite monkey theorem.</strong>"},{"text":"According to <a href=https://en.wikipedia.org/wiki/Infinite_monkey_theorem target=_blank>Wikipedia</a>, “<strong>the infinite monkey theorem</strong> states that a monkey hitting keys at random on a typewriter keyboard for an infinite amount of time will almost surely type any given text, such as the complete works of William Shakespeare.”"},{"text":"“Yeah, right,” you may be thinking. You are not alone. Podcasting mogul Joe Rogan has <em>mostly</em> refused to believe it (though to be fair, he did mainly fixate on the monkey’s behavior than the concept).","youtube":"joe"},{"text":"In episode 710 he admits, “it could be possible, but I’ve seen no evidence that it has ever been able to be replicated, even in a simple sentence.”"},{"text":"Challenge accepted, Joe. Though we thought it would be more fun to do it with music instead of something that felt like a required school reading."},{"text":"Before we jump back into the tunes, a quick but important math digression. How likely is the Shakespeare thing, for real? Even if we just ask a monkey to type Hamlet, without punctuation, the odds are unthinkably small.","video":"shakespeare"},{"text":"To understand this number, we bring back Beethoven. How do we calculate the odds of just getting the first two notes (G, G) correct from just two keys?","graphic":"odds","type":"tk"},{"text":"As we play additional notes, the chances of success become more slim. Here is that same thing, visually, with all four notes.","graphic":"probability","type":"note"},{"text":"You get the picture, the number of possibilities goes up <strong>exponentially</strong> with each new note. So Shakespeare will effectively take “forever,” but if we did have forever, it would (almost surely) happen!"},{"text":"While the probability kept shrinking for the Beethoven melody, it was still quite likely, quite quickly. But we cheated, a bit. We assumed that all notes are the same length. What happens to the odds when we include two possible durations for each note?","graphic":"probability","type":"duration"},{"text":"We ran this too. We also decided to zoomorphize our computer, meet Meryl the monkey. It took her X attempts to get it right.","graphic":"piano","type":"Meryl"},{"text":"But I think Joe needs more proof.  After all, we aren’t even using a full piano equivalent of a typewriter. So we’ve actually crafted a real experiment, which has now been running since __.","graphic":"clock / results"},{"text":"We ask Meryl to perform millions of random attempts <em>every minute</em> since she never gets tired. Each time she makes a breakthrough, we gradually increase the complexity; increasing the song length, note duration options, or piano size. Here is what she has achieved so far:","graphic":"results table"},{"text":"And if you were hoping to catch a live performance, you’re in luck! She plays live right here, 24/7/365. Here is what she is working on now (though we slowed it down so you can keep up).","graphic":"piano","type":"live"},{"text":"We think there is a good chance she will get <span>current melody</span> right in the next __."},{"text":"Tk"},{"text":"And now you can play around with each song and generate them on your own.","graphic":"piano","type":"tk"},{"text":"All said and done, the point here isn’t the real numbers. Hopefully the progression here gives you some faith that given enough time, randomness will prevail. Will our simple model eventually play the Nokia ringtone in our lifetime? Almost certainly not. Given enough time would it? Almost surely."},{"text":"Want more, be sure to check out the <a href=http://libraryofbabel.info/ target=_blank>Library of Babel</a>."}],"method":[{"type":"text","value":"We deviate from the typical thought exercise implementation by restarting after each attempt vs a continuous string of key mashing."},{"type":"text","value":"We run more attempts per minute to speed up time simulation as complexity grows."}]}